In [1]:
import pandas as pd
import numpy as np
pd.set_option('display.max_columns', None)

In [10]:
data1 = pd.read_csv('df_final_demo.csv')
data1.head()

,Unnamed: 0,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [15]:
data1.shape

(70594, 9)

In [12]:
data1 = data1.drop('Unnamed: 0', axis = 1)

In [16]:
data1['client_id'].nunique()

70594

In [14]:
data1.isna().sum()

client_id           0
clnt_tenure_yr      0
clnt_tenure_mnth    0
clnt_age            0
gendr               0
num_accts           0
bal                 0
calls_6_mnth        0
logons_6_mnth       0
dtype: int64

In [17]:
data1[data1['clnt_age'].isna()]

Empty DataFrame
Columns: [client_id, clnt_tenure_yr, clnt_tenure_mnth, clnt_age, gendr, num_accts, bal, calls_6_mnth, logons_6_mnth]
Index: []

In [18]:
data1.shape

(70594, 9)

In [19]:
data1 = data1.dropna()
data1.shape

(70594, 9)

In [9]:
data1.to_csv('df_final_demo.csv')

In [21]:
data2a = pd.read_csv('df_final_web_data_pt_1.csv')
data2b = pd.read_csv('df_final_web_data_pt_2.csv')

In [22]:
data2a.head()

,Unnamed: 0,client_id,visitor_id,visit_id,process_step,date_time
0,0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [23]:
data2a['process_step'].unique()

array(['step_3', 'step_2', 'step_1', 'start', 'confirm'], dtype=object)

In [24]:
data2a.isna().sum()

Unnamed: 0      0
client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [25]:
data2b.isna().sum()

Unnamed: 0      0
client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [16]:
data2a.to_csv('df_final_web_data_pt_1.csv')
data2b.to_csv('df_final_web_data_pt_2.csv')

In [26]:
data2b.shape

(412264, 6)

In [27]:
data2a.shape

(343141, 6)

In [28]:
data2 = pd.concat([data2a, data2b], axis=0)

In [29]:
data2.shape

(755405, 6)

In [22]:
data2.to_csv('df_final_web_data.csv')

In [30]:
data2.head()

,Unnamed: 0,client_id,visitor_id,visit_id,process_step,date_time
0,0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [24]:
data1.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [25]:
dataXXX = data1.merge(data2, left_on='client_id', right_on='client_id')
dataXXX.shape # this is not the correct way to merge

(449704, 13)

In [31]:
data = data2.merge(data1, left_on='client_id', right_on='client_id')

In [32]:
data.shape

(449704, 14)

In [33]:
data.head()

,Unnamed: 0,client_id,visitor_id,visit_id,process_step,date_time,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0
1,1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0
2,2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0
3,3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0
4,4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0

shape of original data2 merged file was ~700k but this merged file has ~450k. This means that there are a lot of clients in the data1 file that are not present here

In [37]:
data3 = pd.read_csv('df_final_experiment_clients.csv')
data3 = data3.drop('Unnamed: 0', axis = 1)
data3.head()

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

In [38]:
data3.shape

(50500, 2)

In [39]:
data3['Variation'].value_counts()

Test       26968
Control    23532
Name: Variation, dtype: int64

In [40]:
data3.isna().sum()

client_id    0
Variation    0
dtype: int64

In [41]:
data3 = data3.dropna()
data3.shape

(50500, 2)

In [42]:
data3['client_id'].nunique()

50500

In [43]:
data = data.merge(data3, left_on='client_id', right_on='client_id')

In [44]:
data.shape

(321195, 15)

as you can see , again there's some information drop
from ~450 k to ~320k. As some other analysis, you can find out which were the clients whose information was available on data3 but not in data2

In [45]:
data.isna().sum()

Unnamed: 0          0
client_id           0
visitor_id          0
visit_id            0
process_step        0
date_time           0
clnt_tenure_yr      0
clnt_tenure_mnth    0
clnt_age            0
gendr               0
num_accts           0
bal                 0
calls_6_mnth        0
logons_6_mnth       0
Variation           0
dtype: int64

In [46]:
data['date_time'] = pd.to_datetime(data['date_time'])

In [52]:
data.to_csv('finalMergedFile.csv')

In [50]:
data = data.drop('Unnamed: 0', axis = 1)

In [54]:
data.head(10)

,client_id,visitor_id,visit_id,process_step,date_time,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth,Variation
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0,Test
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0,Test
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0,Test
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0,Test
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0,Test
5,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:17:15,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0,Test
6,9988021,580560515_7732621733,781255054_21935453173_531117,step_1,2017-04-17 15:17:01,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0,Test
7,9988021,580560515_7732621733,781255054_21935453173_531117,start,2017-04-17 15:16:22,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0,Test
8,9988021,580560515_7732621733,219729223_42518459208_211914,start,2017-04-12 18:54:43,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0,Test
9,9988021,580560515_7732621733,219729223_42518459208_211914,start,2017-04-12 18:38:42,5.0,64.0,79.0,U,2.0,189023.86,1.0,4.0,Test

(321195, 14)

In [47]:
df = data.copy()

In [48]:
df = df.drop_duplicates() 
df.shape

(321195, 15)

In [43]:
# df.duplicated().value_counts() # To check if the code worked